{"info": {"datasetId": 4549, "datasetSlug": "youtube-new", "ownerUser": "datasnaek", "usabilityRating": 0.7941176470588235, "totalViews": 2135703, "totalVotes": 5843, "totalDownloads": 292850, "title": "Trending YouTube Video Statistics", "subtitle": "Daily statistics for trending YouTube videos", "description": "UPDATE: Source code used for collecting this data [released here](https://github.com/DataSnaek/Trending-YouTube-Scraper)\n\n### Context\n\nYouTube (the world-famous video sharing website) maintains a list of the [top trending videos](https://www.youtube.com/feed/trending) on the platform. [According to Variety magazine](http://variety.com/2017/digital/news/youtube-2017-top-trending-videos-music-videos-1202631416/), “To determine the year’s top-trending videos, YouTube uses a combination of factors including measuring users interactions (number of views, shares, comments and likes). Note that they’re not the most-viewed videos overall for the calendar year”. Top performers on the YouTube trending list are music videos (such as the famously virile “Gangam Style”), celebrity and/or reality TV performances, and the random dude-with-a-camera viral videos that YouTube is well-known for.\n\nThis dataset is a daily record of the top trending YouTube videos.\n\nNote that this dataset is a structurally improved version of [this dataset](https://www.kaggle.com/datasnaek/youtube).\n\n### Content\n\nThis dataset includes several months (and counting) of data on daily trending YouTube videos. Data is included for the US, GB, DE, CA, and FR regions (USA, Great Britain, Germany, Canada, and France, respectively), with up to 200 listed trending videos per day.\n\nEDIT: Now includes data from RU, MX, KR, JP and IN regions (Russia, Mexico, South Korea, Japan and India respectively) over the same time period.  \n\nEach region’s data is in a separate file. Data includes the video title, channel title, publish time, tags, views, likes and dislikes, description, and comment count.\n\nThe data also includes a `category_id` field, which varies between regions. To retrieve the categories for a specific video, find it in the associated `JSON`. One such file is included for each of the five regions in the dataset.\n\nFor more information on specific columns in the dataset refer to the [column metadata](https://www.kaggle.com/datasnaek/youtube-new/data).\n\n### Acknowledgements\n\nThis dataset was collected using the YouTube API.\n\n### Inspiration\n\nPossible uses for this dataset could include:\n\n* Sentiment analysis in a variety of forms\n* Categorising YouTube videos based on their comments and statistics.\n* Training ML algorithms like RNNs to generate their own YouTube comments.\n* Analysing what factors affect how popular a YouTube video will be.\n* Statistical analysis over time\f.\n\nFor further inspiration, see the kernels on this dataset!", "keywords": ["languages", "popular culture", "arts and entertainment", "linguistics", "internet"], "licenses": [{"name": "CC0-1.0"}]}}